import 'package:get/get.dart';

class LocalString extends Translations {
  @override
  // TODO: implement keys
  Map<String, Map<String, String>> get keys => {
    'en_US': {
      'language': 'Please Choose a language',
      'confirm': 'Confirm',
      'Login/Sign Up': 'Login/Sign Up',
      'Enter your Phone Number': 'Enter your Phone Number\n',
      'Phone Number': 'Phone Number',
      'App_Permissions': 'App Permissions',
      'clauses': 'We understand the nature and sensitivity of this topic and have taken strong measures to ensure that your data is not compromised.',
      'T&C': 'Terms And Conditions',
    },

    'hi_IN': {
      'language': 'कृपया भाषा चुनें',
      'confirm': 'पुष्टि करें',
      'Login/Sign Up': 'लॉग इन/साइन इन',
      'Enter your Phone Number': 'अपना फोन नंबर डालें',
      'Phone Number': 'फ़ोन नंबर',
      'App_Permissions': 'ऐप अनुमतियाँ',
      'T&C': 'नियम और शर्तें',
      'clauses': 'आपकी गोपनीयता हमारी प्राथमिकता है। हम केवल आवश्यक डेटा को एकत्रित करते हैं, और आपका व्यक्तिगत डेटा सुरक्षित रहता है!\n\n'
          'हम कैसे काम करते हैं:\n'
          'निश्चल फ़ॉक्सइंटेलिजेंस की सेवा है। ऐप को मुफ़्त बनाने के लिए, हम इलेक्ट्रॉनिक वाणिज्य पर सांख्यिकीय उद्देश्यों के लिए बाज़ार डेटा का प्रचार करते हैं। हम किसी भी प्रकार के विज्ञापन, लक्ष्यण, डेटाबेस, या प्रोफ़ाइल वृद्धि के लिए कोई डेटा प्रसारित नहीं करते हैं।\n\n'
          'आपका डेटा सुरक्षित रहता है:\n'
          'निश्चल का उपयोग करके, आपको कभी भी विज्ञापनों के लिए लक्षित नहीं किया जाएगा, चाहे हमारे उत्पाद पर हो या बाद में।',
    },

    'gu_IN': {
      'language': 'કૃપા કરીને એક ભાષા પસંદ કરો',
      'confirm': 'પુષ્ટિ કરો',
      'Login/Sign Up': 'લૉગ ઇન/સાઇન ઇન',
      'Enter your Phone Number': 'તમારો ફોન નંબર દાખલ કરો',
      'Phone Number': 'ફોન નંબર',
      'App_Permissions': 'એપ્લિકેશન પરવાનગીઓ',
      'T&C': 'શરતો અને શરતો',
      'clauses': 'તમારી ગોપનીયતા અમારી પ્રાથમિકતા છે. અમે માત્ર આવશ્યક ડેટા એકત્ર કરીએ છીએ, અને તમારા વ્યક્તિગત ડેટા સંરક્ષિત છે!\n\n'
          'અમે કેવી રીતે કામ કરીએ:\n'
          'નિશ્ચલ એ ફોક્સઇન્ટેલિજેન્સની સેવા છે. ઍપને મુફ્ત બનાવવા માટે, અમે ઇ-વાણિજ્યિક પરિસર પર આંકડાશાસ્ત્રીય ઉદ્દેશ્યો માટે માર્કેટિંગ ડેટાનો ઉપયોગ કર્યો છે. અમે કોઈ પણ પ્રકારની વિજ્ઞાપન, લક્ષ્યિત, ડેટાબેસ, અથવા પ્રોફાઇલ વૃદ્ધિ માટે કોઈ ડેટા પ્રસારિત નહીં કરીએ છીએ.\n\n'
          'તમારા ડેટા સંરક્ષિત છે:\n'
          'નિશ્ચલનો ઉપયોગ કરીને, તમને ક્યારેયપણ પ્રચાર માટે લક્ષ્યિત નહીં કરવામાં આવશે, આમાં તમારા ઉત્પાદ પર નહીં અને તત્કાલિક પરંતુ'
    },


    'kn_IN': {
      'language': 'ದಯವಿಟ್ಟು ಒಂದು ಭಾಷೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡಿ',
      'confirm': 'ದೃಢೀಕರಿಸಿ',
      'Login/Sign Up': 'ಲಾಗಿನ್/ಸೈನ್ ಇನ್',
      'Enter your Phone Number': 'ನಿಮ್ಮ ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ',
      'Phone Number': 'ದೂರವಾಣಿ ಸಂಖ್ಯೆ',
      'App_Permissions': 'ಅಪ್ಲಿಕೇಶನ್ ಅನುಮತಿಗಳು',
      'T&C': 'ನಿಯಮಗಳು ಮತ್ತು ಶರತ್ತುಗಳು',
      'clauses': 'ನಿಮ್ಮ ಗೌಪ್ಯತೆಯು ನಮ್ಮ ಪ್ರಾಧಾನ್ಯತೆಯಾಗಿದೆ. ನಾವು ಮಾತ್ರ ಅಗತ್ಯವಿದ್ದ ಡೇಟಾವನ್ನು ಸಂಗ್ರಹಿಸುತ್ತೇವೆ, ಮತ್ತು ನಿಮ್ಮ ವೈಯಕ್ತಿಕ ಡೇಟಾ ಸಂರಕ್ಷಿತವಾಗಿದೆ!\n\n'
          'ನಾವು ಹೇಗೆ ಕೆಲಸ ಮಾಡುತ್ತಿದ್ದೇವೆ:\n'
          'ನಿಶ್ಚಲ ಫಾಕ್ಸಿಂಟೆಲಿಜೆನ್ಸ್ ಸೇವೆಯೇ ನಾವು ಒದಗಿಸುವ ಆಪ್ಲಿಕೇಶನ್ ಆಗಿದೆ. ಆಪ್ಲಿಕೇಶನ್ ಉಚಿತವಾಗಿದ್ದು, ನಾವು ಇ-ವಾಣಿಜ್ಯದ ಪ್ರಾಸಂಗಿಕ ಉದ್ದೇಶಗಾಗಿ ಪರಿಸರದ ಡೇಟಾವನ್'

    },

  };
}
